In [1]:
import pandas as pd
import numpy as np

In [2]:
s=pd.Series([1,2,3,4,5,6,7,8])
s

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [4]:
data=pd.date_range("20251210",periods=12)
data

DatetimeIndex(['2025-12-10', '2025-12-11', '2025-12-12', '2025-12-13',
               '2025-12-14', '2025-12-15', '2025-12-16', '2025-12-17',
               '2025-12-18', '2025-12-19', '2025-12-20', '2025-12-21'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df=pd.DataFrame(np.random.randn(12,4),index=data,columns=['a','b','c','d'])
df

                   a         b         c         d
2025-12-10 -1.722859  0.475574  0.531078 -0.204747
2025-12-11  0.039208 -0.589811  0.009498 -0.393743
2025-12-12  0.039104 -0.371756 -0.491220 -0.726458
2025-12-13 -0.181197 -0.361150 -0.720337 -1.237202
2025-12-14  0.207056 -1.004428 -0.902681  1.161188
2025-12-15  1.106325  0.697182 -0.712070 -0.034905
2025-12-16 -0.598850  0.220260  0.944777 -0.698089
2025-12-17 -2.678854  2.609448 -0.933485  1.387622
2025-12-18  0.042557  0.208936  0.504509  1.401234
2025-12-19 -1.321058 -0.284463 -0.011445 -1.548143
2025-12-20 -0.217956  0.861271  0.716253 -0.367495
2025-12-21 -0.264570 -0.197116  0.197105 -1.342236

In [66]:
a=1
df2=pd.DataFrame({
    'A':0.1,
    'gender':[np.random.choice(['male','female'])],
    'blood_group':[np.random.choice(['A','A+','B','B+','C','C+'])]
})
df2

     A  gender blood_group
0  0.1  female           A

In [67]:
df2.describe()

         A
count  1.0
mean   0.1
std    NaN
min    0.1
25%    0.1
50%    0.1
75%    0.1
max    0.1

In [68]:
df3 = pd.DataFrame(

    {

        "A": 1.0,

        "B": pd.Timestamp("20130102"),

        "C": pd.Series(1, index=list(range(4)), dtype="float32"),

        "D": np.array([3] * 4, dtype="int32"),

        "E": pd.Categorical(["test", "train", "test", "train"]),

        "F": "foo",

    }

)

In [69]:
df3["A"]

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [73]:
df3[:]

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [74]:
df3.loc[:,["A","B"]]

     A          B
0  1.0 2013-01-02
1  1.0 2013-01-02
2  1.0 2013-01-02
3  1.0 2013-01-02

In [75]:
df3[df3['A']>0]

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo